Revit 2026 API

# DialogBoxShowingEventArgs Methods

---

The DialogBoxShowingEventArgs type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Cancel | When the event is cancellable, may call the Cancel() method to cancel it. (Inherited from RevitAPIPreEventArgs) |
|  | Dispose | (Inherited from RevitAPIEventArgs) |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsCancelled | Indicates whether the event is being cancelled. (Inherited from RevitAPIEventArgs) |
|  | OverrideResult | Call this method to cause the Autodesk Revit dialog to be dismissed with the specified return value. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

DialogBoxShowingEventArgs Class

Autodesk.Revit.UI.Events Namespace